(require "./Matrisp.lisp")

(<> 
 
 ((2 4 3) (1 5 7) (8 9 7)) +- 
 ((2 4 3) (1 5 7) (8 9 7)) -+
 @ 
 {}
 ((4 4 1) (0 2 1) (2 1 1)) {}
 -+
 +-
 @
 
<>) 

;ВЫВОД
;7 
;4 
;47 
;((2 1 8) (4 5 9) (3 7 7)) 
;((4 0 2) (4 2 1) (1 1 1)) 
;2 
;1 
;8 


;Максимум минимумов матрицы
(<> ((2 4 3) (1 5 7) (8 9 7)) +- print) 
;7

;Минимум максимумов матрицы
(<> ((2 4 3) (1 5 7) (8 9 7)) -+ print) 
;4

;Транспонирование матрицы 
(<> ((2 4 3) (1 5 7) (8 9 7)) {} print)
;(2 1 8) (4 5 9) (3 7 7)

;Определитель матрицы
(<> ((6 11 1) (3 3 18) (4 0.67 6.67)) @ print)
;609.6 


